In [1]:
import pandas as pd

In [3]:
data = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
data = pd.DataFrame([1,2,3,4,5])
data

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
 lst = [[1,2,3,4,5],[6,7,8,9,10]]
df = pd.DataFrame(lst)
df

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [8]:
dic = {'name':['kamal','saman','nimal'],'marks':[20,30,40]}
df = pd.DataFrame(dic)
df

    name  marks
0  kamal     20
1  saman     30
2  nimal     40

In [9]:
dict1 = {'kamal':[1,2,3,4,5],'nimal':[6,7,8,9,10]}
df1 = pd.DataFrame(dict1)
dict2 = {'sunil':[11,12,13,14,15],'Anil':[16,17,18,19,20]}
df2 = pd.DataFrame(dict2)

In [10]:
df1

   kamal  nimal
0      1      6
1      2      7
2      3      8
3      4      9
4      5     10

In [11]:
df2

   sunil  Anil
0     11    16
1     12    17
2     13    18
3     14    19
4     15    20

In [12]:
pd.concat([df1,df2])

   kamal  nimal  sunil  Anil
0    1.0    6.0    NaN   NaN
1    2.0    7.0    NaN   NaN
2    3.0    8.0    NaN   NaN
3    4.0    9.0    NaN   NaN
4    5.0   10.0    NaN   NaN
0    NaN    NaN   11.0  16.0
1    NaN    NaN   12.0  17.0
2    NaN    NaN   13.0  18.0
3    NaN    NaN   14.0  19.0
4    NaN    NaN   15.0  20.0